УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_ПривязкаЗакупки/КонтурЗакупки_ПривязкаЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЗакупки_ПривязкаЗакупки</name>
  <resources>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Закупка</name>
    <type>
      <types>DocumentRef.КонтурЗакупки_Закупка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_ПривязкаСправочников/КонтурЗакупки_ПривязкаСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЗакупки_ПривязкаСправочников</name>
  <resources>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СправочникЗакупки</name>
    <type>
      <types>CatalogRef.КонтурЗакупки_ШаблоныПоиска</types>
      <types>CatalogRef.КонтурЗакупки_ОтраслиОбновленные</types>
      <types>CatalogRef.КонтурЗакупки_Отрасли</types>
      <types>CatalogRef.КонтурЗакупки_СтатусыЗакупки</types>
      <types>CatalogRef.КонтурЗакупки_Метки</types>
      <types>CatalogRef.КонтурЗакупки_ШаблоныЗагрузкиИзбранного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.КонтурЗакупки/src/CommonModules/КонтурЗакупки_ЛокализацияВызовСервера/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПривязкаДокумента
// Получить закупку из привязки.
// 
// Параметры:
//  ТипОбъекта - Строка - Тип объекта
//  ИдентификаторОбъекта - Строка - Идентификатор объекта
//  Назначение - Строка, Неопределено - Назначение
// 
// Возвращаемое значение:
//  ДокументСсылка.КонтурЗакупки_Закупка, Неопределено - Получить закупку из привязки
Функция ПолучитьЗакупкуИзПривязки(ТипОбъекта, ИдентификаторОбъекта, Назначение = Неопределено) Экспорт
	ДокументЗакупки = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_ПривязкаЗакупки.Закупка КАК Закупка
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_ПривязкаЗакупки КАК КонтурЗакупки_ПривязкаЗакупки
	|ГДЕ
	|	КонтурЗакупки_ПривязкаЗакупки.ТипОбъекта = &ТипОбъекта
	|	И КонтурЗакупки_ПривязкаЗакупки.ИдентификаторОбъекта = &ИдентификаторОбъекта
	|	И ВЫБОР
	|			КОГДА &ЕстьНазначение
	|				ТОГДА КонтурЗакупки_ПривязкаЗакупки.Назначение = &Назначение
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";

	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("ЕстьНазначение", Не Назначение = Неопределено);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументЗакупки = Выборка.Закупка;
	КонецЕсли;

	Возврат ДокументЗакупки;
КонецФункции

// Получить ссылку на объект из привязки.
// 
// Параметры:
//  СсылкаНаЗакупку - ДокументСсылка.КонтурЗакупки_Закупка - Ссылка на закупку
//  ТипОбъекта - Строка - Тип объекта
//  Назначение - Строка - Назначение
// 
// Возвращаемое значение:
//  СправочникСсылкаИмяСправочника, ДокументСсылкаИмяДокумента, Неопределено, БизнесПроцессСсылкаИмяБизнесПроцесса - Получить ссылку на объект из привязки
Функция ПолучитьСсылкуНаОбъектИзПривязки(СсылкаНаЗакупку, ТипОбъекта, Назначение) Экспорт
	СсылкаНаОбъект = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ПривязкаЗакупки.ТипОбъекта КАК ТипОбъекта,
	|	КонтурЗакупки_ПривязкаЗакупки.ИдентификаторОбъекта КАК ИдентификаторОбъекта
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_ПривязкаЗакупки КАК КонтурЗакупки_ПривязкаЗакупки
	|ГДЕ
	|	КонтурЗакупки_ПривязкаЗакупки.Закупка = &Закупка
	|	И КонтурЗакупки_ПривязкаЗакупки.Назначение = &Назначение
	|	И КонтурЗакупки_ПривязкаЗакупки.ТипОбъекта = &ТипОбъекта";
	Запрос.УстановитьПараметр("Закупка", СсылкаНаЗакупку);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МассивТипа = СтрРазделить(ТипОбъекта, ".");
		Если МассивТипа.Количество() = 2 Тогда
			Если МассивТипа[0] = "Справочники" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = Справочники[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
				Исключение
				КонецПопытки;
			ИначеЕсли МассивТипа[0] = "Документы" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = Документы[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
				Исключение
				КонецПопытки;
			ИначеЕсли МассивТипа[0] = "БизнесПроцессы" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = БизнесПроцессы[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат СсылкаНаОбъект;
КонецФункции

// Создать привязку закупки.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_Закупка - Документ основание
//  ТипОбъекта - Строка - Тип объекта
//  Назначение - Строка - Назначение
//  ИдентификаторОбъекта - Строка, УникальныйИдентификатор - Идентификатор объекта
//  Представление - Строка - Представление
Процедура СоздатьПривязкуЗакупки(ДокументОснование, ТипОбъекта, Назначение, ИдентификаторОбъекта, Представление = "") Экспорт
	Запись = РегистрыСведений.КонтурЗакупки_ПривязкаЗакупки.СоздатьМенеджерЗаписи();
	Запись.Закупка = ДокументОснование;
	Запись.ТипОбъекта = ТипОбъекта;
	Запись.ИдентификаторОбъекта = ?(ТипЗнч(ИдентификаторОбъекта) = Тип("УникальныйИдентификатор"), XMLСтрока(
		ИдентификаторОбъекта), ИдентификаторОбъекта);
	Запись.Назначение = Назначение;
	Запись.Представление = Представление;
	Запись.Записать();
КонецПроцедуры
#КонецОбласти

#Область ПривязкаСправочников
// Получить справочник закупки из привязки.
// 
// Параметры:
//  ТипОбъекта - Строка - Тип объекта
//  ИдентификаторОбъекта - Строка - Идентификатор объекта
//  Назначение - Строка, Неопределено - Назначение
// 
// Возвращаемое значение:
//  СправочникСсылка, Неопределено - Получить справочник закупки из привязки
Функция ПолучитьСправочникИзПривязки(ТипОбъекта, ИдентификаторОбъекта, Назначение = Неопределено) Экспорт
	СправочникЗакупки = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЗакупки_ПривязкаСправочников.СправочникЗакупки КАК СправочникЗакупки
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_ПривязкаСправочников КАК КонтурЗакупки_ПривязкаСправочников
	|ГДЕ
	|	КонтурЗакупки_ПривязкаСправочников.ТипОбъекта = &ТипОбъекта
	|	И КонтурЗакупки_ПривязкаСправочников.ИдентификаторОбъекта = &ИдентификаторОбъекта
	|	И ВЫБОР
	|		КОГДА &ЕстьНазначение
	|			ТОГДА КонтурЗакупки_ПривязкаСправочников.Назначение = &Назначение
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";

	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("ЕстьНазначение", Не Назначение = Неопределено);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СправочникЗакупки = Выборка.Закупка;
	КонецЕсли;

	Возврат СправочникЗакупки;
КонецФункции

// Получить ссылку на справочник из привязки.
// 
// Параметры:
//  СсылкаНаСправочник - СправочникСсылка - Ссылка на закупку
//  ТипОбъекта - Строка - Тип объекта
//  Назначение - Строка - Назначение
// 
// Возвращаемое значение:
//  СправочникСсылкаИмяСправочника, ДокументСсылкаИмяДокумента, Неопределено, БизнесПроцессСсылкаИмяБизнесПроцесса - Получить ссылку на объект из привязки
Функция ПолучитьСсылкуНаСправочникИзПривязки(СсылкаНаСправочник, ТипОбъекта, Назначение) Экспорт
	СсылкаНаОбъект = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЗакупки_ПривязкаСправочников.ТипОбъекта КАК ТипОбъекта,
	|	КонтурЗакупки_ПривязкаСправочников.ИдентификаторОбъекта КАК ИдентификаторОбъекта
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_ПривязкаСправочников КАК КонтурЗакупки_ПривязкаСправочников
	|ГДЕ
	|	КонтурЗакупки_ПривязкаСправочников.СправочникЗакупки = &СсылкаНаСправочник
	|	И КонтурЗакупки_ПривязкаСправочников.Назначение = &Назначение
	|	И КонтурЗакупки_ПривязкаСправочников.ТипОбъекта = &ТипОбъекта";
	Запрос.УстановитьПараметр("СсылкаНаСправочник", СсылкаНаСправочник);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МассивТипа = СтрРазделить(ТипОбъекта, ".");
		Если МассивТипа.Количество() = 2 Тогда
			Если МассивТипа[0] = "Справочники" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = Справочники[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
				Исключение
				КонецПопытки;
			ИначеЕсли МассивТипа[0] = "Документы" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = Документы[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
				Исключение
				КонецПопытки;
			ИначеЕсли МассивТипа[0] = "БизнесПроцессы" Тогда
				//@skip-check empty-except-statement
				Попытка
					СсылкаНаОбъект = БизнесПроцессы[МассивТипа[1]].ПолучитьСсылку(
							Новый УникальныйИдентификатор(Выборка.ИдентификаторОбъекта));
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат СсылкаНаОбъект;
КонецФункции

// Создать привязку справочника закупки.
// 
// Параметры:
//  СправочникОснование - СправочникСсылка - Справочник основание
//  ТипОбъекта - Строка - Тип объекта
//  Назначение  - Строка - Назначение
//  ИдентификаторОбъекта  - Строка - Идентификатор объекта
//  Представление - Строка - Представление
Процедура СоздатьПривязкуСправочникаЗакупки(СправочникОснование, ТипОбъекта, Назначение, ИдентификаторОбъекта,
	Представление = "") Экспорт
	Запись = РегистрыСведений.КонтурЗакупки_ПривязкаСправочников.СоздатьМенеджерЗаписи();
	Запись.СправочникЗакупки = СправочникОснование;
	Запись.ТипОбъекта = ТипОбъекта;
	Запись.ИдентификаторОбъекта = ИдентификаторОбъекта;
	Запись.Назначение = Назначение;
	Запись.Представление = Представление;
	Запись.Записать();
КонецПроцедуры
#КонецОбласти

#Область Прочие_вызовы_Типовых_процедур
Функция ПодготовитьКоллекциюПечатныхФорм(Знач Идентификаторы) Экспорт
	КоллекцияПечатныхФорм = Неопределено;
	Попытка
		ОМУправлениеПечатью = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		КоллекцияПечатныхФорм = ОМУправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(Идентификаторы);
	Исключение

	КонецПопытки;

	Возврат КоллекцияПечатныхФорм;

КонецФункции

Функция ПодготовитьСтруктуруПараметровВывода() Экспорт
	ПараметрыВывода = Неопределено;
	Попытка
		ОМУправлениеПечатью = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		ПараметрыВывода = ОМУправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	Исключение

	КонецПопытки;
	Возврат ПараметрыВывода;

КонецФункции

Функция СформироватьПечатныеФормыДляБыстройПечати(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати) Экспорт
	ПечатныеФормы = Неопределено;
	Попытка
		ОМУправлениеПечатью = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		ПечатныеФормы = ОМУправлениеПечатью.СформироватьПечатныеФормыДляБыстройПечати(ИмяМенеджераПечати, ИменаМакетов,
			МассивОбъектов, ПараметрыПечати);
	Исключение

	КонецПопытки;

	Возврат ПечатныеФормы;
КонецФункции

Функция ЗарегистрироватьОбработку(Знач Объект, Знач ПараметрыРегистрации) Экспорт
	Результат = Ложь;
	Попытка
		ОМДополнительныеОтчетыИОбработки = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль(
				"ДополнительныеОтчетыИОбработки");
		Результат = ОМДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(Объект, ПараметрыРегистрации);
	Исключение

	КонецПопытки;
	Возврат Результат;

КонецФункции

Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения = Неопределено) Экспорт
	Попытка
		ОМПодключаемыеКоманды = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль(
				"ПодключаемыеКоманды");
		ОМПодключаемыеКоманды.ПриСозданииНаСервере(Форма, ПараметрыРазмещения);
	Исключение

	КонецПопытки;
КонецПроцедуры

Процедура ВыполнитьКоманду(Знач Форма, Знач ПараметрыВызова, Знач Источник, Результат = Неопределено) Экспорт
	Попытка
		ОМПодключаемыеКоманды = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль(
				"ПодключаемыеКоманды");
		ОМПодключаемыеКоманды.ВыполнитьКоманду(Форма, ПараметрыВызова, Источник, Результат);
	Исключение

	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ПредставленияОбъектов
Функция ПредставлениеТипаЗадачаСотрудника() Экспорт
	Возврат "Документы.ЗадачаСотрудника";
КонецФункции

Функция ПредставлениеТипаЗадание() Экспорт
	Возврат "БизнесПроцессы.Задание";
КонецФункции

Функция ПредставлениеТипаИнтерес() Экспорт
	Возврат "Документы.CRM_Интерес";
КонецФункции

Функция ПредставлениеТипаСделка() Экспорт
	Возврат "Справочники.СделкиСКлиентами";
КонецФункции

Функция ПредставлениеТипаЗаказКлиента() Экспорт
	Возврат "Документы.ЗаказКлиента";
КонецФункции

#КонецОбласти

#Область СозданиеСвязанныхОбъектов

// Создать задачу сотруднику.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_Закупка - Документ основание
//  ЗадачаСсылка - ДокументСсылка - Задача ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать задачу сотруднику на сервере
Функция СоздатьЗадачуСотруднику(ДокументОснование, ЗадачаСсылка = Неопределено, ОписаниеРезультата = "") Экспорт
	Продолжать = Истина;

	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		ДокументЗадачаСотрудникаОбъект = Документы["ЗадачаСотрудника"].СоздатьДокумент();

		СтандартнаяОбработкаПМ = Истина;

		ПараметрыПМ = Новый Структура;
		ПараметрыПМ.Вставить("ОбъектДляЗаполнения", ДокументЗадачаСотрудникаОбъект);
		ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);

		КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"ЗаполнитьДокументЗадачаСотрудника", ПараметрыПМ, СтандартнаяОбработкаПМ);

		Если СтандартнаяОбработкаПМ Тогда
			ЗаполнитьДокументЗадачаСотрудника(ДокументОснование, ДокументЗадачаСотрудникаОбъект);
		КонецЕсли;

		ДокументЗадачаСотрудникаОбъект.Записать();
		ЗадачаСсылка = ДокументЗадачаСотрудникаОбъект.Ссылка;
	КонецЕсли;

	Возврат Продолжать;
КонецФункции

// Создать задание.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_Закупка - Документ основание
//  ЗаданиеСсылка - ДокументСсылка - Задание ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать задание на сервере
Функция СоздатьЗадание(ДокументОснование, ЗаданиеСсылка = Неопределено, ОписаниеРезультата = "") Экспорт
	Продолжать = Истина;
	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		БПЗаданиеОбъект = БизнесПроцессы["Задание"].СоздатьБизнесПроцесс();

		СтандартнаяОбработкаПМ = Истина;

		ПараметрыПМ = Новый Структура;
		ПараметрыПМ.Вставить("ОбъектДляЗаполнения", БПЗаданиеОбъект);
		ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);

		КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"ЗаполнитьБПЗадание", ПараметрыПМ, СтандартнаяОбработкаПМ);

		Если СтандартнаяОбработкаПМ Тогда
			ЗаполнитьБПЗадание(ДокументОснование, БПЗаданиеОбъект);
		КонецЕсли;

		БПЗаданиеОбъект.Записать();
		ЗаданиеСсылка = БПЗаданиеОбъект.Ссылка;
	КонецЕсли;

	Возврат Продолжать;
КонецФункции

// Создать интерес.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_Закупка - Документ основание
//  ИнтересСсылка - ДокументСсылка - Интерес ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать задание на сервере
Функция СоздатьИнтерес(ДокументОснование, ИнтересСсылка = Неопределено, ОписаниеРезультата = "") Экспорт
	Продолжать = Истина;

	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		ДокументИнтересОбъект = Документы["CRM_Интерес"].СоздатьДокумент();

		СтандартнаяОбработкаПМ = Истина;

		ПараметрыПМ = Новый Структура;
		ПараметрыПМ.Вставить("ОбъектДляЗаполнения", ДокументИнтересОбъект);
		ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);

		КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"ЗаполнитьДокументИнтерес", ПараметрыПМ, СтандартнаяОбработкаПМ);

		Если СтандартнаяОбработкаПМ Тогда
			ЗаполнитьДокументИнтерес(ДокументОснование, ДокументИнтересОбъект);
		КонецЕсли;

		ДокументИнтересОбъект.Записать();
		ИнтересСсылка = ДокументИнтересОбъект.Ссылка;
	КонецЕсли;

	Возврат Продолжать;
КонецФункции

// Создать сделку.
// 
// Параметры:
//  ДокументОснование - ДокументСсылка.КонтурЗакупки_Закупка - Документ основание
//  СделкаСсылка - СправочникСсылкаИмяСправочника - Сделка ссылка
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Создать задание на сервере
Функция СоздатьСделку(ДокументОснование, СделкаСсылка = Неопределено, ОписаниеРезультата = "") Экспорт
	Продолжать = Истина;
	Если ДокументОснование.Пустая() Тогда
		Продолжать = Ложь;
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Исходный документ не записан. Нажмите Записать'")
			+ Символы.ПС;
	КонецЕсли;

	Если Продолжать Тогда
		СправочникСделкиСКлиентамиОбъект = Справочники["СделкиСКлиентами"].СоздатьЭлемент();

		СтандартнаяОбработкаПМ = Истина;

		ПараметрыПМ = Новый Структура;
		ПараметрыПМ.Вставить("ОбъектДляЗаполнения", СправочникСделкиСКлиентамиОбъект);
		ПараметрыПМ.Вставить("ДокументОснование", ДокументОснование);

		КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"ЗаполнитьСправочникСделкиСКлиентами", ПараметрыПМ, СтандартнаяОбработкаПМ);

		Если СтандартнаяОбработкаПМ Тогда
			ЗаполнитьСправочникСделкиСКлиентами(ДокументОснование, СправочникСделкиСКлиентамиОбъект);
		КонецЕсли;

		СправочникСделкиСКлиентамиОбъект.Записать();
		СделкаСсылка = СправочникСделкиСКлиентамиОбъект.Ссылка;

	КонецЕсли;

	Возврат Продолжать;
КонецФункции
#КонецОбласти

#Область Пользователи

// Получить текущего пользователя. Обычно это параметр сеанса с типом справочник пользователи
// 
// Возвращаемое значение:
//  СправочникСсылка - Ссылка на справочник пользователей
Функция ПолучитьТекущегоПользователя() Экспорт
	ТекущийПользователь = Неопределено;
	ТекущийПользователь = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"ПолучитьТекущегоПользователя");

	Если ТекущийПользователь = Неопределено Тогда
		Если Не Метаданные.ПараметрыСеанса.Найти("ТекущийПользователь") = Неопределено Тогда
			ТекущийПользователь = ПараметрыСеанса["ТекущийПользователь"];
		КонецЕсли;
	КонецЕсли;

	Возврат ТекущийПользователь;
КонецФункции

// Установить ответственного.
// 
// Параметры:
//  СсылкаНаОбъект - ДокументСсылка, СправочникСсылка - Ссылка на объект
//  Ответственный - СправочникСсылка - Ответственный
Процедура УстановитьОтветственного(СсылкаНаОбъект, Ответственный) Экспорт
	Если Не Ответственный = Неопределено Тогда
		НаименованиеСправочникаПользователей = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
			"НаименованиеСправочникаПользователей", "Пользователи");
		ЕстьСправочникПользователей = КонтурЗакупки_ЛокализацияСервер.ЕстьСправочник(
			НаименованиеСправочникаПользователей);
		Если ЕстьСправочникПользователей Тогда
			Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КонтурЗакупки_Закупка") Тогда
				СоздатьПривязкуЗакупки(СсылкаНаОбъект, "Справочники." + НаименованиеСправочникаПользователей,
					"Ответственный", XMLСтрока(Ответственный.УникальныйИдентификатор()), Строка(Ответственный));
			Иначе
				СоздатьПривязкуСправочникаЗакупки(СсылкаНаОбъект, "Справочники." + НаименованиеСправочникаПользователей,
					"Ответственный", XMLСтрока(Ответственный.УникальныйИдентификатор()), Строка(Ответственный));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьБПЗадание(ЗакупкаСсылка, БПЗаданиеОбъект)
	БПЗаданиеОбъект.Дата = ТекущаяДатаСеанса();
	БПЗаданиеОбъект.Заполнить(ЗакупкаСсылка);
	БПЗаданиеОбъект.Содержание = СтрШаблон(НСтр("ru = 'Обработать документ закупки: %1'"), Строка(ЗакупкаСсылка));
КонецПроцедуры

Процедура ЗаполнитьДокументИнтерес(ЗакупкаСсылка, ДокументИнтересОбъект)
	ДокументИнтересОбъект.Дата = ТекущаяДатаСеанса();
	ДокументИнтересОбъект.Заполнить(ЗакупкаСсылка);
	ДокументИнтересОбъект.Описание = СтрШаблон(НСтр("ru = 'Обработать документ закупки: %1'"), Строка(ЗакупкаСсылка));
	ДокументИнтересОбъект.ОжидаемаяВыручка = ЗакупкаСсылка.НМЦЗакупки;
	ДокументИнтересОбъект.ОжидаемаяДатаПродажи = ЗакупкаСсылка.ДатаОкончанияПодачиЗаявок;
	ДокументИнтересОбъект.Тема = ЗакупкаСсылка.ОрганизаторНаименование + " / " + ЗакупкаСсылка.ИмяОписаниеЗакупки;
КонецПроцедуры

Процедура ЗаполнитьДокументЗадачаСотрудника(ЗакупкаСсылка, ДокументЗадачаСотрудникаОбъект)
	ДокументЗадачаСотрудникаОбъект.Дата = ТекущаяДатаСеанса();
	ДокументЗадачаСотрудникаОбъект.Заполнить(ЗакупкаСсылка);
	ДокументЗадачаСотрудникаОбъект.Описание = СтрШаблон(НСтр("ru = 'Обработать документ закупки: %1'"), Строка(
		ЗакупкаСсылка));
КонецПроцедуры

#Область ЗаполнениеСделки
Функция ЗаполнитьСправочникСделкиСКлиентами(ЗакупкаСсылка, СправочникСделкиСКлиентамиОбъект)
	Партнер = Неопределено;

	ОрганизаторНаименование = ЗакупкаСсылка.ОрганизаторНаименование;
	ОрганизаторИНН = ЗакупкаСсылка.ОрганизаторИНН;
	ОрганизаторКПП = ЗакупкаСсылка.ОрганизаторКПП;
	Если ПустаяСтрока(ОрганизаторНаименование) И ЗакупкаСсылка.Заказчики.Количество() > 0 Тогда

		ОрганизаторНаименование = ЗакупкаСсылка.Заказчики[0].Заказчики_ОрганизацияНаименование;
		ОрганизаторИНН = ЗакупкаСсылка.Заказчики[0].ОрганизацияИНН;
		ОрганизаторКПП = ЗакупкаСсылка.Заказчики[0].ОрганизацияКПП;
	КонецЕсли;

	Контрагент = ПолучитьКонтрагента(ОрганизаторИНН, ОрганизаторКПП);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Партнер = Контрагент.Партнер;
	КонецЕсли;

	Если Истина Тогда
			//Если Не ЗначениеЗаполнено(Партнер) Тогда
		СтруктураПартнера = Новый Структура;
		СтруктураПартнера.Вставить("Комментарий", НСтр("ru = '#Создан автоматически из закупки'"));

		СтруктураПартнера.Вставить("НаименованиеПолное", ОрганизаторНаименование);
		СтруктураПартнера.Вставить("Наименование", ОрганизаторНаименование);
		СтруктураПартнера.Вставить("ДатаРегистрации", ТекущаяДатаСеанса());
		СтруктураПартнера.Вставить("ПрочиеОтношения", Истина);
		СтруктураПартнера.Вставить("ЮрФизЛицо", Перечисления.КомпанияЧастноеЛицо.Компания);

		СтруктураКонтактнаяИнформацияПартнера = Новый Структура;
		Если Не ПустаяСтрока(ЗакупкаСсылка.КонтактныеДанныеТелефон) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("ТелефонКонтактногоЛица",
				ЗакупкаСсылка.КонтактныеДанныеТелефон);
		КонецЕсли;
		Если Не ПустаяСтрока(ЗакупкаСсылка.КонтактныеДанныеЭлектроннаяПочта) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("EmailКонтактногоЛица",
				ЗакупкаСсылка.КонтактныеДанныеЭлектроннаяПочта);
		КонецЕсли;
		Если Не ПустаяСтрока(ЗакупкаСсылка.КонтактныеДанныеИмя) Тогда
			СтруктураКонтактнаяИнформацияПартнера.Вставить("КонтактноеЛицо", ЗакупкаСсылка.КонтактныеДанныеИмя);
		КонецЕсли;
		СтруктураПартнера.Вставить("КонтактнаяИнформация", СтруктураКонтактнаяИнформацияПартнера);

		Партнер = НайтиСоздатьПартнера(СтруктураПартнера);
	КонецЕсли;

	СправочникСделкиСКлиентамиОбъект.Партнер = Партнер;
	СправочникСделкиСКлиентамиОбъект.Статус = Перечисления.СтатусыСделок.ВРаботе;
	СправочникСделкиСКлиентамиОбъект.Комментарий = СтрШаблон(
		НСтр("ru = '#Создано автоматически на основании закупки %1 от %2'"), ЗакупкаСсылка.НомерЗакупки, Формат(
			ЗакупкаСсылка.ДатаСозданияЗакупки, "ДЛФ=DDT"));
	СправочникСделкиСКлиентамиОбъект.Наименование = ЗакупкаСсылка.ИмяОписаниеЗакупки;
	СправочникСделкиСКлиентамиОбъект.ВалютаПервичногоСпроса = ПолучитьВалютуПоСимвКоду(?(Не ПустаяСтрока(
		ЗакупкаСсылка.Валюта), ЗакупкаСсылка.Валюта, "RUB"));
	ЗаполнитьПервичныйСпрос(ЗакупкаСсылка, СправочникСделкиСКлиентамиОбъект);

	Возврат СправочникСделкиСКлиентамиОбъект;
КонецФункции

Процедура ЗаполнитьПервичныйСпрос(ЗакупкаСсылка, СделкаОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.НаименованиеОбъектаЗакупки = """"
	|			ТОГДА КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.НаименованиеОбъектаЗакупки
	|		ИНАЧЕ ВЫБОР
	|				КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Код ЕСТЬ NULL
	|					ТОГДА КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Расшифровка
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУКод ЕСТЬ NULL
	|					ТОГДА КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУРасшифровка
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Код ЕСТЬ NULL
	|					ТОГДА КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Расшифровка
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ТекстовоеОписание,
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.ОбщаяСтоимостьОбъекта КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Код ЕСТЬ NULL
	|			ТОГДА ""ОКПД2 "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Код + "" "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.ОКПД2Расшифровка + "" | ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУКод ЕСТЬ NULL
	|			ТОГДА ""КТРУ "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУКод + "" "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.КТРУРасшифровка + "" | ""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Код ЕСТЬ NULL
	|			ТОГДА ""ОКВЭД2 "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Код + "" "" + КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.ОКВЭД2Расшифровка
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий
	|ИЗ
	|	Документ.КонтурЗакупки_Закупка.ОбъектыЗакупки КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыОКПД2 КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ключ
	|			И КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ссылка = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКПД2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыКТРУ КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ключ
	|			И КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ссылка = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиКТРУ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЗакупки_Закупка.КодыОКВЭД2 КАК КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2
	|		ПО КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ключ_ОбъектыЗакупки = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ключ
	|			И КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ссылка = КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупкиОКВЭД2.Ссылка
	|ГДЕ
	|	КонтурЗакупки_ЗакупкаТабличнаяЧастьОбъектыЗакупки.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ЗакупкаСсылка);

	СделкаОбъект.ПервичныйСпрос.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Функция ПолучитьВалютуПоСимвКоду(СимвКод)
	ВозвратВалюта = Справочники.Валюты.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Валюты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Наименование = &Наименование";

	Запрос.УстановитьПараметр("Наименование", СимвКод);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвратВалюта = Выборка.Ссылка;
	КонецЕсли;

	Возврат ВозвратВалюта;

КонецФункции

Функция НайтиСоздатьПартнера(СтруктураПартнера)
	// обрежем, наименование, что бы искать по полному и не создать дубликат
	ВозвратПартнер = ПолучитьПартнера(Лев(СтруктураПартнера.НаименованиеПолное, 250));
	Если ЗначениеЗаполнено(ВозвратПартнер) Тогда
		НовПартнер = ВозвратПартнер.ПолучитьОбъект();
	Иначе
		НовПартнер = Справочники["Партнеры"].СоздатьЭлемент();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(НовПартнер, СтруктураПартнера);

	Попытка
		НовПартнер.Записать();
		ВозвратПартнер = НовПартнер.Ссылка;
	Исключение
	КонецПопытки;

	СтруктураКИ = СтруктураПартнера.КонтактнаяИнформация;

	Если ЗначениеЗаполнено(ВозвратПартнер) И СтруктураКИ.Количество() > 0 Тогда
		НовоеКЛ = Справочники["КонтактныеЛицаПартнеров"].СоздатьЭлемент();
		НовоеКЛ.Владелец = ВозвратПартнер;

		Если СтруктураКИ.Свойство("КонтактноеЛицо") Тогда
			НовоеКЛ.Наименование = СтруктураПартнера.КонтактнаяИнформация["КонтактноеЛицо"];
		Иначе
			НовоеКЛ.Наименование = "Не указано";
		КонецЕсли;

		ЕстьОМ_УКИ = Истина;

		Попытка
			ОМУправлениеКонтактнойИнформацией = КонтурЗакупки_ОбщегоНазначения.ОбщийМодуль(
			"УправлениеКонтактнойИнформацией");
		Исключение
			ЕстьОМ_УКИ = Ложь;
		КонецПопытки;

		Если ЕстьОМ_УКИ Тогда
			Если СтруктураКИ.Свойство("ТелефонКонтактногоЛица") Тогда
				ОМУправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовоеКЛ,
					СтруктураКИ["ТелефонКонтактногоЛица"],
					Справочники["ВидыКонтактнойИнформации"].ТелефонКонтактногоЛица);
			КонецЕсли;

			Если СтруктураКИ.Свойство("EmailКонтактногоЛица") Тогда
				ОМУправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовоеКЛ,
					СтруктураКИ["EmailКонтактногоЛица"], Справочники["ВидыКонтактнойИнформации"].EmailКонтактногоЛица);
			КонецЕсли;

		КонецЕсли;
		НовоеКЛ.Записать();
	КонецЕсли;

	Возврат ВозвратПартнер;
КонецФункции

Функция ПолучитьКонтрагента(ИНН, КПП)
	ВозвратКонтрагент = Справочники["Контрагенты"].ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.КПП = &КПП";
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвратКонтрагент = Выборка.Ссылка;
	КонецЕсли;

	Возврат ВозвратКонтрагент;
КонецФункции

Функция ПолучитьПартнера(НаименованиеПолное)
	ВозвратПартнер = Справочники["Партнеры"].ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Партнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.НаименованиеПолное = &НаименованиеПолное";
	Запрос.УстановитьПараметр("НаименованиеПолное", НаименованиеПолное);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВозвратПартнер = Выборка.Ссылка;
	КонецЕсли;

	Возврат ВозвратПартнер;
КонецФункции
#КонецОбласти
#КонецОбласти

#КонецЕсли
